0 Dev Training/1 Junior/1 Java Demo/19 WSDL/0/Soap.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">

<SOAP-ENV:Body>
	<ns1:echoString xmlns:ns1="http://soapinterop.org/">
		<arg0 xsi:type="xsd:string">Hello!</arg0>
	</ns1:echoString>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>