assets/js/89.a0d99eba.js

(window.webpackJsonp=window.webpackJsonp||[]).push([[89],{456:function(s,n,a){"use strict";a.r(n);var e=a(5),t=Object(e.a)({},(function(){var s=this,n=s._self._c;return n("ContentSlotsDistributor",{attrs:{"slot-key":s.$parent.slotKey}},[n("p",[s._v("教程："),n("a",{attrs:{href:"https://www.runoob.com/soap/soap-envelope.html",target:"_blank",rel:"noopener noreferrer"}},[s._v("SOAP"),n("OutboundLink")],1),s._v("\n微软中是用")]),s._v(" "),n("div",{staticClass:"language- line-numbers-mode"},[n("pre",{pre:!0,attrs:{class:"language-text"}},[n("code",[s._v('soap:Envelope（http://www.microsoft.com/china/MSDN/library/WebServices/WebServices/UnderstandingSOAP.mspx）\n<soap:Envelope\n xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">\n <soap:Body>\n  <x:TransferFundsResponse\n   xmlns:x="urn:examples-org:banking">\n   <balances>\n    <account>\n     <id>22-342439</id>\n     <balance>33.45</balance>\n    </account>\n    <account>\n     <id>98-283843</id>\n     <balance>932.73</balance>\n    </account>\n   </balances>\n  </x:TransferFundsResponse>\n </soap:Body>\n</soap:Envelope>\n')])]),s._v(" "),n("div",{staticClass:"line-numbers-wrapper"},[n("span",{staticClass:"line-number"},[s._v("1")]),n("br"),n("span",{staticClass:"line-number"},[s._v("2")]),n("br"),n("span",{staticClass:"line-number"},[s._v("3")]),n("br"),n("span",{staticClass:"line-number"},[s._v("4")]),n("br"),n("span",{staticClass:"line-number"},[s._v("5")]),n("br"),n("span",{staticClass:"line-number"},[s._v("6")]),n("br"),n("span",{staticClass:"line-number"},[s._v("7")]),n("br"),n("span",{staticClass:"line-number"},[s._v("8")]),n("br"),n("span",{staticClass:"line-number"},[s._v("9")]),n("br"),n("span",{staticClass:"line-number"},[s._v("10")]),n("br"),n("span",{staticClass:"line-number"},[s._v("11")]),n("br"),n("span",{staticClass:"line-number"},[s._v("12")]),n("br"),n("span",{staticClass:"line-number"},[s._v("13")]),n("br"),n("span",{staticClass:"line-number"},[s._v("14")]),n("br"),n("span",{staticClass:"line-number"},[s._v("15")]),n("br"),n("span",{staticClass:"line-number"},[s._v("16")]),n("br"),n("span",{staticClass:"line-number"},[s._v("17")]),n("br"),n("span",{staticClass:"line-number"},[s._v("18")]),n("br"),n("span",{staticClass:"line-number"},[s._v("19")]),n("br")])]),n("p",[s._v("Apache是用")]),s._v(" "),n("div",{staticClass:"language- line-numbers-mode"},[n("pre",{pre:!0,attrs:{class:"language-text"}},[n("code",[s._v('SOAP-ENV:Envelope\n<?xml version="1.0" encoding="UTF-8"?>\n<SOAP-ENV:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"\n                   xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"\n                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">\n  <SOAP-ENV:Body>\n    <ns1:echoString xmlns:ns1="http://soapinterop.org/">\n      <arg0 xsi:type="xsd:string">Hello!</arg0>\n    </ns1:echoString>\n  </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>\n')])]),s._v(" "),n("div",{staticClass:"line-numbers-wrapper"},[n("span",{staticClass:"line-number"},[s._v("1")]),n("br"),n("span",{staticClass:"line-number"},[s._v("2")]),n("br"),n("span",{staticClass:"line-number"},[s._v("3")]),n("br"),n("span",{staticClass:"line-number"},[s._v("4")]),n("br"),n("span",{staticClass:"line-number"},[s._v("5")]),n("br"),n("span",{staticClass:"line-number"},[s._v("6")]),n("br"),n("span",{staticClass:"line-number"},[s._v("7")]),n("br"),n("span",{staticClass:"line-number"},[s._v("8")]),n("br"),n("span",{staticClass:"line-number"},[s._v("9")]),n("br"),n("span",{staticClass:"line-number"},[s._v("10")]),n("br"),n("span",{staticClass:"line-number"},[s._v("11")]),n("br")])]),n("p",[s._v("IBM中却见过")]),s._v(" "),n("div",{staticClass:"language- line-numbers-mode"},[n("pre",{pre:!0,attrs:{class:"language-text"}},[n("code",[s._v("soapenv:Envelope \n")])]),s._v(" "),n("div",{staticClass:"line-numbers-wrapper"},[n("span",{staticClass:"line-number"},[s._v("1")]),n("br")])])])}),[],!1,null,null,null);n.default=t.exports}}]);